#include <stdio.h>
/**
 * 奖金根据利润提成，求奖金？
 * 利润低于或等于10万元时，奖金可提10%。
 * 利润高于10万元低于20万元的部分，提成7.5%。
 * 20万到40万之间，提成5%。
 * 40万到60万之间，提成3%。
 * 60万到100万之间，提成1.5%。
 * 高于100万元部分，提成1%。
 */
int main()
{
  double I = 0; //利润
  double B = 0; //奖金
  printf("请输入你的利润：");
  scanf("%lf", &I);

  //100万~
  if (I > 100 * 10000)
  {
    B += (I - 100 * 10000) * 0.01;
    I = 100 * 10000;
  }
  //60万~100万
  if (I > 60 * 10000)
  {
    B += (I - 60 * 10000) * 0.015;
    I = 60 * 10000;
  }
  //40万~60万
  if (I > 40 * 10000)
  {
    B += (I - 40 * 10000) * 0.03;
    I = 40 * 10000;
  }
  //20万~40万
  if (I > 20 * 10000)
  {
    B += (I - 20 * 10000) * 0.05;
    I = 20 * 10000;
  }
  //10万~20万
  if (I > 10 * 10000)
  {
    B += (I - 10 * 10000) * 0.075;
    I = 10 * 10000;
  }
  //0~10万
  if (I > 0)
  {
    B += I * 0.1;
  }
  printf("你的奖金 = %lf", B);
  return 0;
}