#include <stdio.h>

/**
 * 根据利润占比求奖金？
 */

int main() {
  double I = 0;  //利润
  double B = 0;  //奖金
  printf("请输入你的利润：");
  scanf("%lf", &I);

  // 高于100万的部分提成1%
  if (I > 100 * 10000) {
    B += (I - 100 * 10000) * 0.01;
    I = 100 * 10000;
  }
  // 高于60低于100万的部分提成1.5%
  if (I > 60 * 10000) {
    B += (I - 60 * 10000) * 0.015;
    I = 60 * 10000;
  }
  // 高于40低于60万的部分提成3%
  if (I > 40 * 10000) {
    B += (I - 40 * 10000) * 0.03;
    I = 40 * 10000;
  }
  // 高于20低于40万的部分提成5%
  if (I > 20 * 10000) {
    B += (I - 20 * 10000) * 0.05;
    I = 20 * 10000;
  }
  // 高于10低于20万的部分提成5%
  if (I > 10 * 10000) {
    B += (I - 10 * 10000) * 0.075;
    I = 10 * 10000;
  }
  // 高于0低于10万的部分提成10%
  if (I > 0) {
    B += I * 0.1;
  }
  printf("奖金 = %.2lf\n", B);
}